Gov/Vocab.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-25 Wed 17:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vocabulary</title>
<meta name="author" content="Alex Burns" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Vocabulary</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb32d54a">Chapter 1 Vocab:</a>
<ul>
<li><a href="#org393cc74">Section 2:</a></li>
<li><a href="#org57d473e">Section 3:</a></li>
<li><a href="#org5633334">Section 4:</a></li>
</ul>
</li>
<li><a href="#org4b6b693">Chapter 2 Vocab:</a>
<ul>
<li><a href="#orgefaf3c6">Section 1:</a></li>
<li><a href="#orgaef2fc4">Section 2:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb32d54a" class="outline-2">
<h2 id="orgb32d54a">Chapter 1 Vocab:</h2>
<div class="outline-text-2" id="text-orgb32d54a">
</div>
<div id="outline-container-org393cc74" class="outline-3">
<h3 id="org393cc74">Section 2:</h3>
<div class="outline-text-3" id="text-org393cc74">
</div>
<ul class="org-ul">
<li><a id="org487a31c"></a>Unitary System: a system of government that gives all key powers to the nation/central government<br /></li>
<li><a id="org4461032"></a>Federal System: divides the powers of government between the national government and the state or principal government<br /></li>
<li><a id="org00b4915"></a>Confederacy: a loose union of independent states<br /></li>
<li><a id="org066992d"></a>Constitution: a plan that provides rules for government<br /></li>
<li><a id="orgeb27bfe"></a>Constitutional Government: refers to a government in which a constitution has authority to place clearly recognized limits on the powers of those who govern<br /></li>
<li><a id="orgac573be"></a>Preamble: a statement that sets forth the goals and purposes to be served by the government<br /></li>
<li><a id="orgc1d330a"></a>Constitutional law: involves the interpretation and application of the constitution. Defines the extent and limits of government and rights of citizens<br /></li>
<li><a id="org23183d7"></a>Politics: the effort to control or influence the conduct and policies of government<br /></li>
<li><a id="orgef27b8b"></a>Industrialized nations: have generally large industries and advanced technology that provide a more comfortable way of life than developing nations<br /></li>
<li><a id="org1da2c4f"></a>Developing nations: are only beginning to develop industry. Typically when a nation is first starting, these nations tend to be poorer than industrialized nations<br /></li>
</ul>
</div>

<div id="outline-container-org57d473e" class="outline-3">
<h3 id="org57d473e">Section 3:</h3>
<div class="outline-text-3" id="text-org57d473e">
</div>
<ul class="org-ul">
<li><a id="org31c847f"></a>Autocracy: any system of government in which the power and authority to rule are in the hands of a single individual<br /></li>
<li><a id="org9cac895"></a>Monarchy: another form of autocratic government. In a monarchy, a kind queen or emporer exercises the supreme power of government<br /></li>
<li><a id="org75a9d6f"></a>Oligarchy: any system of government in which a small group holds power<br /></li>
<li><a id="org0dc73c7"></a>Democracy: any system of government in which rule is byt he people<br /></li>
<li><a id="orgfd54e12"></a>Republic: voters are the source of the governments authority<br /></li>
<li><a id="org674dccf"></a>Political Party: a group of individuals with broad common interests who organize to nominate canidates for office, win elections, conduct government and determine public policy<br /></li>
<li><a id="orga60789f"></a>Free Enterprise: the opportunity to control one&rsquo;s economic decisions<br /></li>
</ul>
</div>

<div id="outline-container-org5633334" class="outline-3">
<h3 id="org5633334">Section 4:</h3>
<div class="outline-text-3" id="text-org5633334">
</div>
<ul class="org-ul">
<li><a id="org8dc52f4"></a>Economics: the study of human efforts to satisfy seemingly unlimited wants through the use of limited resources<br /></li>
<li><a id="org7b13937"></a>Capitalism: the system of free enterprise, freedom of choice and individual incetntive for workers<br /></li>
<li><a id="org6234f69"></a>Free market: buyers and sellers are free to make unlimited economic decisions in the marketplace<br /></li>
<li><a id="org4568e07"></a>Laissez-faire Economy: to be let alone, government should keep their hands off the economy<br /></li>
<li><a id="org5763890"></a>Socialism: the government owns the basic means of production, determines the use of resources, distributes the products and wages, and provides social services such as education and health care<br /></li>
<li><a id="org25b06fa"></a>Bourgeoise: own the means of production, aka capitalists<br /></li>
<li><a id="org985b3e3"></a>Proletariat: work to produce the goods, aka workers<br /></li>
<li><a id="org5aac8de"></a>Communism: one class exists, property would all be held in common, and there would be no need for government<br /></li>
<li><a id="orgcb988e8"></a>Command Economy: decisions are made at the upper levels of government and handed down to managers<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org4b6b693" class="outline-2">
<h2 id="org4b6b693">Chapter 2 Vocab:</h2>
<div class="outline-text-2" id="text-org4b6b693">
</div>
<div id="outline-container-orgefaf3c6" class="outline-3">
<h3 id="orgefaf3c6">Section 1:</h3>
<div class="outline-text-3" id="text-orgefaf3c6">
</div>
<ul class="org-ul">
<li><a id="orgb7413e5"></a>Limited Government: the power of the monarch, or government, was limited and not absolute<br /></li>
<li><a id="orgb487e96"></a>Representative Government: a government in which people elect delegates to make laws and conduct government<br /></li>
<li><a id="org193cb8f"></a>Separation of powers: divided power of government so that there were checks and balances between the branches<br /></li>
<li><a id="orge02e0ae"></a>Magna Carta: great charter that provided the basis for the principle of limited government to king john in 1215<br /></li>
<li><a id="orgbbee685"></a>Petition of right: Severly limited the king&rsquo;s power in 1628<br /></li>
<li><a id="org84e24c2"></a>English Bill of Rights: a document that was later very important to american colonies which set clear limits on what a ruler can and can not do<br /></li>
<li><a id="org7acb2f1"></a>Mayflower Compact: signed in 1620, stands as the first example of many colenial plans for self-government<br /></li>
<li><a id="org7ff2a6c"></a>Great Fundamanetals: the first basic system of laws in the english colonies in 1636<br /></li>
</ul>
</div>

<div id="outline-container-orgaef2fc4" class="outline-3">
<h3 id="orgaef2fc4">Section 2:</h3>
<div class="outline-text-3" id="text-orgaef2fc4">
</div>
<ul class="org-ul">
<li><a id="org34f8eca"></a>Revenue: the money a government collects from taxes or other sources<br /></li>
<li><a id="org4c914da"></a>Embargo: an agreement prohibiting trade against a country, in this case britian<br /></li>
<li><a id="orga1f9844"></a>Stamp Act: the first direct tax on colonists. Required them to pay a tax on legal documents, pamphlets, newspapers etc in 1765<br /></li>
<li><a id="org2c0a2b2"></a>Intolerable Acts: Closed the boston harbor, removed self-government from massachusetts. A set of laws against the colonists in response to the boston tea party<br /></li>
<li><a id="org67e4452"></a>Albany Plan of Union: an inovative plan for uniting the colonies, but it was rejected because it gave too much power to an assemably of representatives<br /></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alex Burns</p>
<p class="date">Created: 2021-08-25 Wed 17:46</p>
</div>
</body>
</html>
